# Notebook Imports

In [61]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_absolute_error ,mean_squared_error, r2_score

import pickle
import json

# Gathering data And validation :

In [2]:
df = pd.read_csv("medical_insurance.csv")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [3]:
df.shape

(1338, 7)

In [4]:
df.axes

[RangeIndex(start=0, stop=1338, step=1),
 Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')]

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

# EDA :

In [6]:
df.describe()

               age          bmi     children       charges
count  1338.000000  1338.000000  1338.000000   1338.000000
mean     39.207025    30.663397     1.094918  13270.422265
std      14.049960     6.098187     1.205493  12110.011237
min      18.000000    15.960000     0.000000   1121.873900
25%      27.000000    26.296250     0.000000   4740.287150
50%      39.000000    30.400000     1.000000   9382.033000
75%      51.000000    34.693750     2.000000  16639.912515
max      64.000000    53.130000     5.000000  63770.428010

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [8]:
df.isna().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

# Feature Enggineering :

In [9]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

sex       
smoker    
region

### sex

In [11]:
df["sex"] = df["sex"].replace({"male":1, "female":0})

In [12]:
df.head()

   age  sex     bmi  children smoker     region      charges
0   19    0  27.900         0    yes  southwest  16884.92400
1   18    1  33.770         1     no  southeast   1725.55230
2   28    1  33.000         3     no  southeast   4449.46200
3   33    1  22.705         0     no  northwest  21984.47061
4   32    1  28.880         0     no  northwest   3866.85520

In [13]:
df["sex"].value_counts()

1    676
0    662
Name: sex, dtype: int64

### smoker

In [14]:
df["smoker"].value_counts()

no     1064
yes     274
Name: smoker, dtype: int64

In [15]:
df["smoker"] = df["smoker"].replace({"no":1, "yes":0})

In [16]:
df["smoker"].value_counts()

1    1064
0     274
Name: smoker, dtype: int64

In [17]:
df.head()

   age  sex     bmi  children  smoker     region      charges
0   19    0  27.900         0       0  southwest  16884.92400
1   18    1  33.770         1       1  southeast   1725.55230
2   28    1  33.000         3       1  southeast   4449.46200
3   33    1  22.705         0       1  northwest  21984.47061
4   32    1  28.880         0       1  northwest   3866.85520

In [18]:
df["region"].value_counts()

southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64

In [20]:
df1 = pd.get_dummies(df, columns=["region"])

In [21]:
df1.head()

,age,sex,bmi,children,smoker,charges,region_northeast,region_northwest,region_southeast,region_southwest
0,19,0,27.900,0,0,16884.92400,0,0,0,1
1,18,1,33.770,1,1,1725.55230,0,0,1,0
2,28,1,33.000,3,1,4449.46200,0,0,1,0
3,33,1,22.705,0,1,21984.47061,0,1,0,0
4,32,1,28.880,0,1,3866.85520,0,1,0,0

In [23]:
df1.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'charges',
       'region_northeast', 'region_northwest', 'region_southeast',
       'region_southwest'],
      dtype='object')

In [25]:
df2 = df1[['age', 'sex', 'bmi', 'children', 'smoker', 'region_northeast', 'region_northwest', 'region_southeast',
       'region_southwest', 'charges']]

In [26]:
df2.head()

,age,sex,bmi,children,smoker,region_northeast,region_northwest,region_southeast,region_southwest,charges
0,19,0,27.900,0,0,0,0,0,1,16884.92400
1,18,1,33.770,1,1,0,0,1,0,1725.55230
2,28,1,33.000,3,1,0,0,1,0,4449.46200
3,33,1,22.705,0,1,0,1,0,0,21984.47061
4,32,1,28.880,0,1,0,1,0,0,3866.85520

# Feature Selection

# Model Training

In [27]:
x = df2.drop("charges", axis=1)
y = df2["charges"]
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.2, random_state=40)

In [52]:
lr_regr = LinearRegression()
lr_regr.fit(x_train.values, y_train.values)

LinearRegression()

# Model Evaluation

In [56]:
y_pred = lr_regr.predict(x_test.values)

mae = mean_absolute_error(y_test, y_pred)
mse = mean_squared_error(y_test, y_pred)
rmse = np.sqrt(mse)
print("Score :", lr_regr.score(x_test.values, y_test.values))
print("MAE :", mae)
print("RMSE :", rmse)

Score : 0.7341854344194202
MAE : 4358.280567455449
RMSE : 6303.7954487947345

# Model Api Creation :

In [32]:
project_data = {"sex":{"male":1, "female":0},
               "smoker":{"no":1, "yes":0},
               "columns": (x.columns)}

In [34]:
test_array = np.zeros(len(x.columns))

In [38]:
df.head()

   age  sex     bmi  children  smoker     region      charges
0   19    0  27.900         0       0  southwest  16884.92400
1   18    1  33.770         1       1  southeast   1725.55230
2   28    1  33.000         3       1  southeast   4449.46200
3   33    1  22.705         0       1  northwest  21984.47061
4   32    1  28.880         0       1  northwest   3866.85520

In [46]:
project_data = {"sex":{"male":1, "female":0},
               "smoker":{"no":1, "yes":0},
               "columns": list(x.columns)}

In [47]:
age = 40
sex = "male"
bmi = 32
children = 2
smoker = "no"
region = "northwest"

In [57]:
test_array[0] = age
test_array[1] = project_data["sex"]["male"]
test_array[2] = bmi
test_array[3] = 2
test_array[5] = project_data["smoker"]["no"]
region = "region_"+"northwest"
region_idx = project_data["columns"].index(region)
test_array[region_idx] = 1

In [60]:
lr_regr.predict([test_array])[0]

33846.849210628294

In [44]:
df2.head()

,age,sex,bmi,children,smoker,region_northeast,region_northwest,region_southeast,region_southwest,charges
0,19,0,27.900,0,0,0,0,0,1,16884.92400
1,18,1,33.770,1,1,0,0,1,0,1725.55230
2,28,1,33.000,3,1,0,0,1,0,4449.46200
3,33,1,22.705,0,1,0,1,0,0,21984.47061
4,32,1,28.880,0,1,0,1,0,0,3866.85520

In [64]:
with open("mediacl_ins.pickel", "wb") as file:
    pickle.dump(lr_regr, file)
    
with open("project_data.json", "w") as file:
    json.dump(project_data, file)